reserve_v1/reserve.soap

<?xml version="1.0" encoding="utf-8" ?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Body>
    <ns1:test xmlns:ns1="http://telia/testreserve.wsdl">
      <message xmlns="">Hello</message>
    </ns1:test>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>

